[
  {
    "Name": "Hero",
    "HP": 5,
    "St": 3,
    "Ma": 3,
    "Vi": 3,
    "Ag": 3,
    "Lu": 3,
    "Real Name": "Hero",
    "Description": "Just an ordinary guy until he stumbled across Magakins channel and a certain app. He finds himself drawn into the world of Dx2, and the Liberators fight against the Acolytes.",
    "Skillset": "Brings out a demons potential and trains them well. Can also buff Support Demons.",
    "Skills": "[Assist] Heals party members HP by 10%.\n[HP Plus I] +5% to max HP of all party members.\n[St Plus I] +3 to St of all party members.\n[Ma Plus I] +3 to Ma of all party members.\n[Vi Plus I] +3 to Vi of all party members.\n[Ag Plus I] +3 to Ag of all party members.\n[Lu Plus I] +3 to Lu of all party members.\n[Teamwork] +100% to Battle Assist damage dealt and healing by other players.\n[Support Reinforcer] +50% to damage dealt by Support Demons.\n[Demon Trainer I - II - III] +10% - + 30% - +35% to EXP gained by all party members.\n[MP Regain I - II - III] 5% - 10% - 15% chance to increase regenerated MP of all party members by 1.\n[Spring of Life I - II - III] Heals 3% - 5% - 10% HP of all party members between waves.\n[BFF I - II] +5% - +10% chance to receive Assistance from a friend.\n[Chakra Walk I - II] +15% - +50% chance to recover 1 MP of all party members between waves."
  },
  {
    "Name": "Megakin",
    "HP": "",
    "St": "",
    "Ma": "",
    "Vi": 5,
    "Ag": 5,
    "Lu": 5,
    "Real Name": "Taro Fuse",
    "Description": "Leader of the Liberators Tokyo Branch, Megakin is a popular \"Mega:Tuber\". He tries to expose the Acolytes while talking about the latest snacks and toys. He sounds ridiculous but is a passionate content creator.",
    "Skillset": "Grasps elemental affinities well. His charismatic character attracts even demons, making him adept at Demon Talk.",
    "Skills": "[Support] Randomly increases ATK, DEF, or EV/AC of all party members by 20%. (1 turn)\n[Vi Plus I - II] +3 - +5 to Vi of all party members.\n[Ag Plus I - II] +3 - +5 to Ag of all party members.\n[Lu Plus I - II] +3 - +5 to Lu of all party members.\n[Sweet Talker I - II - III] +5% - +10% - +30% to TRICK success rate during Demon Talk.\n[Charisma I - II - III] +5% - +10% - +30% to Demon Talk probability.\n[Beg I - II] +10% - +20% chance of a demon begging for its life.\n[Null Response] When the enemy’s attribute attack is invalidated , the lakkaja is activated with a probability of 10%.\n[Repel Response] +25% chance to cast Tarukaha when repelling attribute attacks.\n[Drain Response] +25% chance to cast Sukukaja when draining attribute attacks.\n[Repel Enhancer] +15% to all damage repelled by all party members.\n[Drain Enhancer] +15% to all amount of HP drained by all party members.\n[Smooth Criminal] When Talk fails your turn will no longer end abruptly and switch to the enemy.\n[Entertainer] Your chance of being liked by a demon during Talk is increased by 50%."
  },
  {
    "Name": "Templar Dragon",
    "HP": 8,
    "St": 5,
    "Ma": 5,
    "Vi": "",
    "Ag": "",
    "Lu": "",
    "Real Name": "Rika Ryuzouji",
    "Description": "Member of the Liberators. Despite attending an upper-class school, shes a gun nut that loves watching gun vids. She is often misunderstood from her lack of expression. Dreams of doing any job that lets her shoot things.",
    "Skillset": "Keeps her cool and aids allies. Has well balanced healing, attack and aid skills.",
    "Skills": "[Assist] +20% to ATK of all party members. (1 turn)\n[HP Plus I - II] +5% - +8% to max HP of all party members.\n[St Plus I - II] +3 - +5 to St of all party members.\n[Ma Plus I - II] +3 - +5 to Ma of all party members.\n[Starting Again I - II] 5% - 10% chance to nullify all party members bad status effects when turn starts.\n[Safety Device I - II] 10% - 15% chance to activate Luster Candy when a party member fails an attack.\n[Healing Master I - II] +5% - +10% to Healing skill effectiveness of all party members.\n[Upgrade I - II] +25% - +50% to damage dealt by all party members in a state of Charge.\n[Dot Sight I - II] +25% - +50% to damage dealt by all party members in a state of Concentrate.\n[Speed Loader] Requires half the amount of Press Turn Icons when using items.\n[Lock and Load] 10% chance to cast Sukunda when an ally enters a state of Charge.\n[Iron Sight] 10% chance to cast Rakunda when an ally enters a state of Concentrate.\n[Way of the Dragon I - II] 5% - 10% chance to avoid losing MP when using a healing skill."
  },
  {
    "Name": "Chalk Eater",
    "HP": "",
    "St": "",
    "Ma": 7,
    "Vi": 7,
    "Ag": "",
    "Lu": "",
    "Real Name": "Shiang Sun",
    "Description": "Member of the Liberators and exchange student from Shanghai. Researches super computers at university. Surfing fan and horror flick super nerd. Thinks Dx2 is \"just like a horror flick!",
    "Skillset": "Can reveal enemy affinities, boost damage to weak points and aid attribute attacks.",
    "Skills": "[Assist] Reveals 1 affinity of an enemy.\n[Ma Plus I - II - III] +3 - +5 - +7 to Ma of all party members.\n[Vi Plus I - II - III] +3 - +5 - +7 to Vi of all party members.\n[Analysis I, II] 10% - 50% chance to reveal an enemy elemental affinity when turn starts.\n[Scream] 10% chance to use only 1 Press Turn icon even if Miss/Null/Repel/Drain activates.\n[Six Sense] 10% chance for all party members to recover 1MP when attacking enemies weak point.\nWeak Killer] 25% chance to cast Tarukaja when attaking enemies weak point.\nWeak Freak] 25% chance to cast Rakukaja when attacking enemies weak point.\n[Weak Sniper ] 25% chance to cast Sukukaja when attacking enemies weak point.\n[Null Recovery] 50% probability to cast Rakunda when an attack is nullified.\n[Repel Recovery] 50% probability to cast Rakunda when an attack is repeled.\n[Drain Recovery] 50% probability to cast Rakunda when an attack is drained."
  },
  {
    "Name": "Eileen",
    "HP": 10,
    "St": "",
    "Ma": "",
    "Vi": "",
    "Ag": "",
    "Lu": 7,
    "Real Name": "Ririn Ueda",
    "Description": "Member of the Liberators. High school student. Likes late night anime, cosplay and has a girl fetish. Dreams of becoming filthy rich. Popular amateur writer. Not overly fond of fighting.",
    "Skillset": "Increases Macca and item drop rates. Maximizes random attack hit rates.",
    "Skills": "[Assist] 100% chance to Bind an enemy.\n[HP Plus I - II - III] +5% - +8% - +10% to max HP of all party members.\n[Lu Plus I - II - III] +3 - +5 - +7 to Lu of all party members.\n[Lucky Press II] 3% - 10% chance to add a Press Turn Icon when a random target attack hits max times.\n[Rip-off I - II - III]  +5% - +10% - +15% to Macca obtained during battle.\n[Gift Thief I - II - III] 5% - 10% - 30% chance to add 1 item drop(s).\n[Lucky Skip I - II] 10% - 20% chance to avoid using Press Turn Icon when skipping a turn.\n[Fragrant Lily] Increases the minimum number of attacks for all Random Attacks by 1.\n[Inspiration] 10% chance to cast Rebellion on a single party member when using a Random Attack.\n[Happy Ending] 10% chance to cast Lydia on all party members when killing an enemy with a Random Attack.\n[Post Script] 10% chance to cast Barrier on all party members when killing an enemy with a Random Attack."
  },
  {
    "Name": "Kangaroo Boxer",
    "HP": "",
    "St": 7,
    "Ma": "",
    "Vi": "",
    "Ag": 7,
    "Lu": "",
    "Real Name": "Jeng Yun Tsai",
    "Description": "Member of the Liberators. A martial artist from Taiwan. He learned Japanese through anime and enjoys drawing himself. A popular guy that is quick to get his kit off.",
    "Skillset": "With good aim and swiftness, attacks first and overwhelms enemies with critical damage.",
    "Skills": "[Assist] +20% to EV/AC of all party members. (1 turn)\n[St Plus I - II - III] +3 - +5 - +7 to St of all party members.\n[Ag Plus I - II - III] +3 - +5 - +7 to Ag of all party members.\n[Position Hack I - II] 10% - 20% chance to attack before the enemy does when having lower Battle Speed.\n[Lightning Attack I - II - III] +5% - +10% - +15% to critical hit rate of all party members when attacking first.\n[Warm Up I - II - III] 10% - 25% - 50% chance to cast Sukunda when entering a state of Rebellion.\n[Accel I - II - III] 5% - 10% - 15% chance to cast Sukukaja when landing a Critical attack.\n[Hot Bod I - II] Extends enemy EV/AC debuffs by 1 - 2 turn(s).\n[Super Hero] 5% chance to nullify the effect when the enemy enters a state of Repel Phys.\n[Count Up] +3% to damage dealt by all party members for each defeated enemy. (max 15 times)"
  },
  {
    "Name": "Shionyan",
    "HP": "",
    "St": "",
    "Ma": 12,
    "Vi": "",
    "Ag": "",
    "Lu": "",
    "Real Name": "Shiori Koden",
    "Description": "Member of the Liberators who discovered this secret society on her own. A 16yo genius that attends a top tier university. Is an \"underground idol\" but her thorny personality keeps fans away.",
    "Skillset": "Good at buffing debuff skills and recovering MP.",
    "Skills": "[Assist] 100% chance to Mute an enemy.\n[Ma Plus I - II - III - IV - V] +3 - +5 - +7 - +10 - +12 to Ma of all party members.\n[Performance I - II] 10% chance for all party members to recover 1 MP when turn starts. \n[Customer Quota I - II] +50% - +100% to Poison damage the enemy receives.\n[Evil Conscience I - II] K8+10% - +20% tp damage a Charmed enemy deals to its fellow demon.\n[Get Salty I - II] Bound enemies receive 2% - 5% damage of their max HP at the end of a turn. (Wont work on Gatekeepers.)\n[No Talking I - II]-25% - -50% probability of the enemy auto recovering from Mute.\n[Give Lip I - II] When a Cursed enemy is healed, decreases the healing amount by 10% - 20%.\n[Purple Confetti] 7% chance for all party members to recover 1 MP when an enemy is Poisoned.\n[Golden Spotlight] 7% chance for all party members to recover 1 MP when an enemy is Bound.\n[Fan Club] 7% chance for all party members to recover 1 MP when an enemy is Charmed.\n[Orange Flowers] 7% chance for all party members to recover 1 MP when an enemy is Muted."
  },
  {
    "Name": "Meat Balloon",
    "HP": "",
    "St": "",
    "Ma": "",
    "Vi": 12,
    "Ag": "",
    "Lu": "",
    "Real Name": "Gakuto Inoue",
    "Description": "Member of the Liberators. Retired SDF and PMC. The sudden change in lifestyle caused him to put on weight. Likes FPS, karaoke and idols. A devoted Shionyan fan.",
    "Skillset": "Uses defensive buffs and counters attacks, defending down to the last demon.",
    "Skills": "[Assist] +20% DEF to all party members. (1 turn)\n[Vi Plus I - II - III - IV - V] +3 - +5 - +7 - +10 - +12 to Vi of all party members.\n[Magic Armour I - II] 5% - 10% chance to cast Rakukaja when attacked by Magic.\n[Warning Shot I - II] 15% - 20% chance to cast Tarunda when receiving a Critical attack.\n[Romance I - II ] Extends DEF buffs by 1 - 2 turn(s)\n[Med Kit I - II] When all allies are wiped out, 10% - 20% chance of last standing demon being revived with full HP. (1 time)\n[Counter Boost I - II - III] +10% - +20% - +40% to countered damage dealt by all party members.\n[Walk It Off] Chance of gaining 1 Press Turn Icons when turn starts. Chance increases by 15% for each party member downed.\n[Counter Bonus I - II - III] All party members will have +10% - +20% - +30% chance to Counter attacks.\n[Adrenaline Rush] For each downed member in your party, +10% to damage dealt by remaining members."
  },
  {
    "Name": "Seiran Saikawa",
    "HP": "",
    "St": "",
    "Ma": "",
    "Vi": "",
    "Ag": 12,
    "Lu": "",
    "Real Name": "Seiran Saikawa",
    "Description": "Member of the Liberators. Seiran Saikawa is tasked with keeping watch over entrance to the Aura Gate. A Taoist scholar, she is knowledgeable in the ways of Feng Shui and the Dragon Stream. Seiran is a notoriously big fan of all things Chinese and tends to wear a Cheongsam. She is also a fan of Kung Fu movies (although she is more Team Sammo than Team Jackie).",
    "Skillset": "Specializing in healing, Seiran is a Dx2 with unmatched Life energy. She also actively explores and charts the Aura Gate.",
    "Skills": "[Assist ] Revives an ally with 10% HP\n[Ag Plus I - II - III - IV - V] +3 - +5 - + 7 - + 10 - +12 to Ag of all party members\n[Game of Life I - II] 10%-15% chance to heal 5% of all party members when turn starts.\n[Dragons Blessing I - II - III] -5% - -10% - -15% chance of receiving status ailments\n[Ward I - II] 10% - 15% chance to prevent Mortal (instant death)\n[Solar Energy] 50% chance to cast when a party member is revived. When cast, heals 10% HP of all party members.\n[Lunar Energy] 50% chance to cast when an enemy is revived. When cast, has a 100% chance to Curse all enemies\n[Solar Destruction] 50% to cast when a party member defeats a demon. When cast, heals 10% HP of all party members\n[Lunar Destruction] 50% to cast when the enemy defeats a demon. When cast, has a 100% chance to Curse all enemies\n[The Guidance of Luopan] When arriving on an Aura Gate floor, Reveals 5x5 panel grid around the boss on the map\n[Blossoming Love I - II - III] +7% - +15% - +25% to Healing skill effectiveness of all party members\n[Project M] Reduces MP use of your party members in the Aura Gate by 1"
  },
  {
    "Name": "Xana",
    "HP": "",
    "St": "",
    "Ma": "",
    "Vi": "",
    "Ag": 12,
    "Lu": "",
    "Real Name": "Xana",
    "Description": "A Hollow emanated from the Aura. Unlike other Hollows, her wish is to learn about humans, not become one herself. Her ability to summon demons awakened only after Hayate gave her his smartphone.",
    "Skillset": "Xana excels at taking the initiative and acting fast in battle. She is especially useful for exploring and battling in Aura Gate 2.",
    "Skills": "[Assist] -20% ATK of all enemies. (1 turn)\n[Ag Plus I - V] +3 - +5 - + 7 - + 10 - +12 to Ag of all party members\n[Hospitality I] 20% chance of revealing the gimmick of 1 Gimmick Room(s) upon entering a Floor in Aura Gate 2. (Will not activate when re-entering a Floor unless Gimmicks have been reset.)\n[MP Time I - III] 5% - 10% - 15% chance to increase regenerated MP of all party members by 1.\n[Just Do It I - III] +5% - +10% - +15% to critical hit rate of all party members when attacking first.\n[Chin Up I - II] +5% - +10% to Healing skill effectiveness of allies.\n[Always Strike First I - II] 5% - 10% chance of casting Rakunda on the first turn when attacking first.\n[Gotta Sterilize Demons!] 50% chance to inflict 10% fractional damage on all enemies based on their max HP (max: 1,000) at the end of own turn during Aura Gate 2 battles.\n[Here's the Main Event] Reduces MP use of your party members in the Aura Gate 2 by 1"
  },
  {
    "Name": "Carbon Black",
    "HP": "",
    "St": 12,
    "Ma": "",
    "Vi": "",
    "Ag": "",
    "Lu": "",
    "Real Name": "Vince",
    "Description": "Formerly a Dx2 of the Acolytes, Vince specializes in Physical attacks.\nAside from increasing physical damage, he also has support skills that can enhance Physical attacks.",
    "Skillset": "Specializes in Physical attacks. Aside from increasing physical damage, Vince also has support skills that can enhance Phsyical attacks.",
    "Skills": "[Assist] -20% DEF of all enemies. (1 turn)\n[St Plus I - V] +3 - +5 - + 7 - + 10 - +12 to St of all party members\n[Hollow-point I - II] +5％ - +10% damage to critical attacks of own party.\n[Backup I - II] Extends enemy DEF debuffs by 1 - 2 turn(s).\n[If Looks Can Kill I-III] 5% - 10% - 15% chance of casting Rakunda when entering a state of Might.\n[Counterattack I - III] 10% - 25% - 50% chance of casting Tarukaja when a party member is Muted.\n[Intimidation I - II] 5％ - 10% chance of casting Tarunda at the beginning of enemy turn."
  }
]